FinalProj/TestMeshes/MeshTest4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          26;
        startFace       140874;
    }
    outlet
    {
        type            patch;
        nFaces          63;
        startFace       140900;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1669;
        startFace       140963;
    }
    wedge1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          71278;
        startFace       142632;
    }
    wedge2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          71278;
        startFace       213910;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       285188;
    }
)

// ************************************************************************* //
